The event journal is almost done. Things to correct: 1. the children are not shown immediately after opening the SquadLogFragment. 2. The children updateEventAttendance fails. 3. Squad children are not shown immediately after authorization. Should be fetched right away. 4. Save notes should work in squads cards dialogue. 5. The colouring is just bad. 6. the icons on notifications are bad. 7. the icons on the squad children tags aren't shown. 8. remove the CircleImageView in children squads. 9. Borders have to have to radius of the selected event. 10. the selection of the dates is only appear when pressed on calendar, but should be pressed on a calendar and on the Input near it.
